In [3]:
import pandas as pd

In [4]:
data = [10,20,30,40,50]

In [5]:
my_series = pd.Series(data)
my_series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [6]:
a=[1,2,3]

In [7]:
my_series = pd.Series(a,index=['x','y','z'])
my_series

x    1
y    2
z    3
dtype: int64

In [8]:
data = [['John',25, 'New York'],
       ['Alice', 30, 'London'],
       ['Bob', 35, 'Paris']]

df = pd.DataFrame(data, columns=['Name','Age','City'])
df

    Name  Age      City
0   John   25  New York
1  Alice   30    London
2    Bob   35     Paris

In [9]:
df.loc[1]

Name     Alice
Age         30
City    London
Name: 1, dtype: object

In [10]:
df['Name']

0     John
1    Alice
2      Bob
Name: Name, dtype: object

In [11]:
data = [[101, 'Milk',32],
       [102, 'Butter',45],
       [103, 'NoteBooks',50],
       [104,'Maggie',24],
       [105, 'Body Lotion',350]]
df = pd.DataFrame(data, columns=['Product Id','Product Name','Product Price'])
df

   Product Id Product Name  Product Price
0         101         Milk             32
1         102       Butter             45
2         103    NoteBooks             50
3         104       Maggie             24
4         105  Body Lotion            350

In [12]:
df['Product Id']

0    101
1    102
2    103
3    104
4    105
Name: Product Id, dtype: int64

In [13]:
df['Product Name']

0           Milk
1         Butter
2      NoteBooks
3         Maggie
4    Body Lotion
Name: Product Name, dtype: object

In [14]:
df['Product Price']

0     32
1     45
2     50
3     24
4    350
Name: Product Price, dtype: int64

In [15]:
df.loc[1]

Product Id          102
Product Name     Butter
Product Price        45
Name: 1, dtype: object

In [16]:
df.loc[2]

Product Id             103
Product Name     NoteBooks
Product Price           50
Name: 2, dtype: object

In [17]:
df.loc[3]

Product Id          104
Product Name     Maggie
Product Price        24
Name: 3, dtype: object

In [18]:
df.loc[4]

Product Id               105
Product Name     Body Lotion
Product Price            350
Name: 4, dtype: object

In [19]:
df.loc[0]

Product Id        101
Product Name     Milk
Product Price      32
Name: 0, dtype: object

In [20]:
df.loc[[0,1,2],['Product Name']]

  Product Name
0         Milk
1       Butter
2    NoteBooks

In [21]:
df.loc[[1,2],['Product Price']]

   Product Price
1             45
2             50

In [44]:
df.loc[[1,2,3],['Product Id','Product Name']]

   Product Id Product Name
1         102       Butter
2         103    NoteBooks
3         104       Maggie

In [45]:
df.loc[[0,1,2],['Product Price']]

   Product Price
0             32
1             45
2             50

In [58]:
data = [[1,'Riya',78,89,34],
       [2,'Kashvi',38,43,95],
       [3,'Rajvi',42,33,94],
       [4,'Nadani',87,56,85],
       [5,'Khushi',17,65,56]]
rt = pd.DataFrame(data, columns=['Id','Name','Maths','English','Science'])
rt

   Id    Name  Maths  English  Science
0   1    Riya     78       89       34
1   2  Kashvi     38       43       95
2   3   Rajvi     42       33       94
3   4  Nadani     87       56       85
4   5  Khushi     17       65       56

In [59]:
marks=rt['Maths']<40
rt.loc[marks ,'Maths']=41
rt

   Id    Name  Maths  English  Science
0   1    Riya     78       89       34
1   2  Kashvi     41       43       95
2   3   Rajvi     42       33       94
3   4  Nadani     87       56       85
4   5  Khushi     41       65       56

In [60]:
a=rt[['Maths','English','Science']]+2
a

   Maths  English  Science
0     80       91       36
1     43       45       97
2     44       35       96
3     89       58       87
4     43       67       58

In [22]:
sal=pd.read_csv('Salaries.csv')
sal

C:\Users\riyat\AppData\Local\Temp\ipykernel_6480\3071597442.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal=pd.read_csv('Salaries.csv')

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [23]:
sal.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [25]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [26]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [27]:
sal.shape

(148654, 13)

In [28]:
sal.info

<bound method DataFrame.info of             Id       EmployeeName  \
0            1     NATHANIEL FORD
1            2       GARY JIMENEZ
2            3     ALBERT PARDINI
3            4  CHRISTOPHER CHONG
4            5    PATRICK GARDNER
...        ...                ...
148649  148650      Roy I Tillery
148650  148651       Not provided
148651  148652       Not provided
148652  148653       Not provided
148653  148654          Joe Lopez

                                              JobTitle       BasePay  \
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY     167411.18
1                      CAPTAIN III (POLICE DEPARTMENT)     155966.02
2                      CAPTAIN III (POLICE DEPARTMENT)     212739.13
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC       77916.0
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)      134401.6
...                                                ...           ...
148649                                       Custodian          0.00
148650                                    Not provided  Not Provided
148651                                    Not provided  Not Provided
148652                                    Not provided  Not Provided
148653                      Counselor, Log Cabin Ranch          0.00

         OvertimePay      OtherPay      Benefits   TotalPay  TotalPayBenefits  \
0                0.0     400184.25           NaN  567595.43         567595.43
1          245131.88     137811.38           NaN  538909.28         538909.28
2          106088.18       16452.6           NaN  335279.91         335279.91
3           56120.71      198306.9           NaN  332343.61         332343.61
4             9737.0     182234.59           NaN  326373.19         326373.19
...              ...           ...           ...        ...               ...
148649          0.00          0.00          0.00       0.00              0.00
148650  Not Provided  Not Provided  Not Provided       0.00              0.00
148651  Not Provided  Not Provided  Not Provided       0.00              0.00
148652  Not Provided  Not Provided  Not Provided       0.00              0.00
148653          0.00       -618.13          0.00    -618.13           -618.13

        Year  Notes         Agency Status
0       2011    NaN  San Francisco    NaN
1       2011    NaN  San Francisco    NaN
2       2011    NaN  San Francisco    NaN
3       2011    NaN  San Francisco    NaN
4       2011    NaN  San Francisco    NaN
...      ...    ...            ...    ...
148649  2014    NaN  San Francisco     PT
148650  2014    NaN  San Francisco    NaN
148651  2014    NaN  San Francisco    NaN
148652  2014    NaN  San Francisco    NaN
148653  2014    NaN  San Francisco     PT

[148654 rows x 13 columns]>

In [30]:
sal['BasePay']

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [35]:
sal['BasePay']

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object